import gx from './src/zxdgx/index'
import dzxds from './src/dzxds/index'
console.log('*********拐向**********************')
console.log('拐向左侧：', gx([[114, 41], [113.35, 39.2]], [[113.35, 39.2], [115, 42]])) // 左侧
console.log('拐向右侧：', gx([[114, 41], [113.35, 39.2]], [[113.35, 39.2], [110, 42]])) // 左侧
console.log('拐向共线：', gx([[114, 41], [113.35, 39.2]], [[113.35, 39.2], [114, 41]])) // 共线
console.log('*********拐向**********************')
console.log('*********点在线段上**********************')
console.log('点在线段上：', dzxds([114.5, 41.5], [[114, 41], [115, 42]]))
console.log('点在线段上：', dzxds([114, 42], [[114, 41], [115, 42]]))
console.log('*********点在线段上**********************')
